# Homebrew Bundle - Common packages (macOS + Linux)
# Managed by jsh pkg

# Taps
tap "oven-sh/bun"

# Formulae
brew "age"
brew "atuin"
brew "awscli"
brew "bat"
brew "btop"
brew "cloudflared"
brew "direnv"
brew "dos2unix"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "gh"
brew "git"
brew "go"
brew "grc"
brew "helm"
brew "helmfile"
brew "hugo"
brew "jq"
brew "k9s"
brew "kind"
brew "krew"
brew "kubecm"
brew "kubecolor"
brew "kubernetes-cli"
brew "kubescape"
brew "kubetail"
brew "mpv"
brew "neovim"
brew "node"
brew "opentofu"
brew "oven-sh/bun/bun"
brew "pipx"
brew "poetry"
brew "prettier"
brew "python"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "snyk-cli"
brew "sops"
brew "speedtest-cli"
brew "stow"
brew "syncthing"
brew "tlrc"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "watch"
brew "wget"
brew "xh"
brew "yq"
brew "zoxide"

# Casks
cask "font-jetbrains-mono-nerd-font"

# Cargo
cargo "cargo-update"
